resources/programming/static-clojure-site-todo-log.html
<div id="edn">
{:title "Static clojure site part XX: What's left to do" :date "2018-08-09" :tags (clojure)}
</div>

<div id="outline-container-orgf58c0ae" class="outline-2">
<h2 id="orgf58c0ae">What's left to do?</h2>
<div class="outline-text-2" id="text-orgf58c0ae">
<p>
Not too much really! I would really like to parse the dates and sort the posts I put in the index page in reverse chronological order. Eventually, I will add a separate <i>archives</i> page to hold all the posts, and a "click here for archives" link at the bottom, but I don't think that will be too difficult once I handle the dates and sorting. My general approach will likely be to parse the dates and use those as keys for the post links or something. Then I can sort the keys and insert the first 10 or so, before adding a "click here for all posts" link to the bottom that goes to a separate "science-archives" or "programming-archives" page with <i>all</i> the links for the relevant posts sorted. I'll have to play with the parsing stuff, but this should be fun. I'd also like to make these functions more resilient. Right now, the <code>edn</code> reading functions are <i>very</i> fragile. Misformed <code>edn</code> or missing quotes will crash it, giving a Java null pointer exception and no useful debugging info. I want to use <code>{:pre :post}</code> conditions, as described <a href="https://github.com/bbatsov/clojure-style-guide#pre-post-conditions">here</a>, or <code>when</code> statements to handle this and make it a bit more resilient.<br />
</p>

<p>
Tests are also on the horizon!<br />
</p>

<p>
Coming very soon!<br />
</p>
</div>
</div>
